Autodesk.Revit.DB.IFC.IFCTransformSetter.Initialize(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.Transform)
Initializes the transformation in the transform setter.
exporterIFC:
The exporter.
transform:
The transform.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.IFC.IFCTransformSetter.InitializeFromBoundingBox(Autodesk.Revit.DB.IFC.ExporterIFC,System.Collections.Generic.IList`1{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.IFC.IFCExtrusionCreationData)
Initializes the transformation in the transform setter.
exporterIFC:
The exporter.
geometryList:
The set of geometry used to determine the bounding box.
exportBodyParams:
The extrusion creation data which contains the local placement.
Returns:
The transform corresponding to the movement, if any.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012